Revit 2025 API
Rebar.MaxSpacing Property
 Identifies the maximum spacing between rebar in rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double MaxSpacing { get; set; }
Public Property MaxSpacing As Double
	Get
	Set
public:
property double MaxSpacing {
	double get ();
	void set (double value);
}
member MaxSpacing : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The maxSpacing isn't bigger than 0.0.
InapplicableDataException |  This rebar element represents a single bar (the layout rule is Single).
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace